Revit 2024 API
FabricationRodInfo.AttachToStructure Method
 Attaches to the nearest structural element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public void AttachToStructure()
Visual Basic
Public Sub AttachToStructure
Visual C++
public:
void AttachToStructure()
See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace